assignment2/Group21PROYECT/app/views/tasks/_form.html.erb

SELECT "users".* FROM "users"
---
                <%= f.label :Informer %>
                <%= f.collection_select :user_id, User.all, :id, :name, {prompt: "Select an Informer"}, {class: "form-control"} %>

SELECT "users".* FROM "users"
---
                <%= f.label :Asignee %>
                <%= f.collection_select :asignee_task_id, User.all, :id, :name, {prompt: "Select an Assignee"}, {class: "form-control"} %>

SELECT "states".* FROM "states"
---
                <%= f.label :state_id %>
                <%= f.collection_select :state_id, State.all, :id, :name, {prompt: "Select a State"}, {class: "form-control"} %>