assignment2/Group21PROYECT/app/views/tasks/_form.html.erb

                <% UserToBoard.where(user_id:current_user.id).each do |usertoboard| %>
                    <% UserToBoard.all.each do |usertoboard2| %>
                        <% if usertoboard.board_id == usertoboard2.board_id %>
                            <% unless asignee_names.include?(usertoboard2.user.name) %>
---
SELECT "boards".* FROM "boards"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]