assignment2/Group21PROYECT/app/views/boards/_form.html.erb

                <%= f.label :user_id %>
                <%= f.collection_select :user_id, User.all, :id, :name, {prompt: "Select an creator"}, {class: "form-control"} %>
---
SELECT "users".* FROM "users"