assignment2/Group21PROYECT/app/views/boards/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."state_id" = $1  [["state_id", 7]]
---
                <div class="container">
                <% state.tasks.each do |task| %>