assignment2/Group21PROYECT/app/views/states/_form.html.erb

SELECT "boards".* FROM "boards"
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
                <% boards = []%>
                <% UserToBoard.all.each do |usertoboard| %>
                    <% if current_user.id == usertoboard.user_id %>
                        <% unless boards.include?(usertoboard.board_id) %>
                            <% boards << Board.find(usertoboard.board_id) %>