assignment2/Group21PROYECT/app/models/board.rb

        def default_states
            states.create([{name: 'TODO'}, {name: 'WIP'}, {name: 'DONE'}])
---
INSERT INTO "states" ("name", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Todo"], ["board_id", 7], ["created_at", "2024-05-20 16:45:20.197658"], ["updated_at", "2024-05-20 16:45:20.197658"]]