assignment2/Group21PROYECT/app/controllers/boards_controller.rb

    def show
        @board = Board.find(params['id'])
        @state = State.find(params['id'])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
		@board = Board.new(board_params)
		if @board.save!
---
INSERT INTO "boards" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New Board"], ["description", "Probando"], ["user_id", 1], ["created_at", "2024-05-20 16:32:43.352263"], ["updated_at", "2024-05-20 16:32:43.352263"]]

    def edit
		@board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def update
		@board = Board.find(params[:id])
		if @board.update board_params
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "boards" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "boards"."id" = $4  [["title", "* New Board *"], ["description", "Probando cambios"], ["updated_at", "2024-05-20 16:38:23.705408"], ["id", 5]]

    def destroy
        @board = Board.find(params[:id])
        @board.destroy
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 9]]