assignment2/Group21PROYECT/app/controllers/static_pages_controller.rb

    def Home
        @recent_boards = Board.order(created_at: :desc).limit(3)
---
SELECT "boards".* FROM "boards" ORDER BY "boards"."created_at" DESC LIMIT $1  [["LIMIT", 3]]