assignment2/Group21PROYECT/app/controllers/states_controller.rb

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
    def show
        @state = State.find(params['id'])

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def new
        if params[:board_id].present?
            @board = Board.find(params[:board_id])

INSERT INTO "states" ("name", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New state"], ["board_id", 4], ["created_at", "2024-05-20 19:52:20.953798"], ["updated_at", "2024-05-20 19:52:20.953798"]]
---
    def create
		@state = State.new(state_params)
        respond_to do |format|
            if @state.save

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
---
    def edit
		@state = State.find(params[:id])

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
UPDATE "states" SET "name" = $1, "updated_at" = $2 WHERE "states"."id" = $3  [["name", "FINAL STATE"], ["updated_at", "2024-05-21 17:19:38.187454"], ["id", 45]]
---
    def update
		@state = State.find(params[:id])
		if @state.update state_params

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "states" WHERE "states"."id" = $1  [["id", 25]]
---
    def destroy
        @state = State.find(params[:id])
        @state.destroy