assignment2/Group21PROYECT/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @task = Task.find(params['id'])

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def new
        if params[:state_id].present?
            @state = State.find(params[:state_id])

INSERT INTO "tasks" ("title", "description", "priority", "custom_attributes", "status", "user_id", "asignee_task_id", "state_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
		@task = Task.new(task_params)
        asignee = AsigneeTask.new(user_id: task_params[:user_id])
        if asignee.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "priority" = $1, "custom_attributes" = $2, "state_id" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["priority", "IMPORTANTE"], ["custom_attributes", "perro"], ["state_id", 8], ["updated_at", "2024-05-23 14:44:35.950630"], ["id", 18]]
---
    def update
		@task = Task.find(params[:id])
		if @task.update task_params